Revit 2026 API

# FolderItemInfo Methods

---

The FolderItemInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetGroupingParameterIdPath | The parameter Id path used to determine the folder items in the browser. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FolderItemInfo Class

Autodesk.Revit.DB Namespace